OpenFOAM_Testing/run_openfoam_hex_amr/0.orig/alpha.lox
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.lox;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    pintleDomain_inlet_o
    {
        type            fixedValue;
        value           uniform 1;
    }

    pintleDomain_inlet_f
    {
        type            fixedValue;
        value           uniform 0;
    }

    "pintleDomain_wall_.*"
    {
        type            zeroGradient;
    }

    pintleDomain_outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    }

    "pintleDomain_periodic_.*"
    {
        type            symmetry;
    }
}


// ************************************************************************* //
