OpenFOAM_Testing/run_openfoam_hex_amr/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "pintleDomain_inlet_.*"
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    "pintleDomain_wall_.*"
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }

    pintleDomain_outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    "pintleDomain_periodic_.*"
    {
        type            symmetry;
    }
}
// ************************************************************************* //
