OpenFOAM_Testing/run_openfoam_hex_amr/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}

dynamicFvMesh   dynamicRefineFvMesh;

dynamicRefineFvMeshCoeffs
{
    // How often to evaluate and refine
    refineInterval  10;

    // Field to refine on
    field           alpha.lox;

    // Refine cells where 0.001 < alpha.lox < 0.999
    lowerRefineLevel 0.1;
    upperRefineLevel 1.0;

    // Unrefine cells when interface leaves and value drops below threshold
    unrefineLevel    0.0005;

    // Transition buffer layers
    nBufferLayers    6;

    // Max refinement cuts per cell
    maxRefinement    3;

    // Stop refinement if maxCells reached
    maxCells         5000000;

    // Flux fields to correct on changed faces
    correctFluxes
    (
        (phi none)
        (nHatf none)
        (rhoPhi none)
        (alphaPhi0.lox none)
        (ghf none)
        (alphaPhiUn none)
        (alphaPhi_ none)
        (dVf_ none)
    );

    // Write refinement level as a volScalarField
    dumpLevel        true;

    protectedPatches ();
}

// ************************************************************************* //