OpenFOAM_Testing/run_openfoam_hex_amr/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases          (lox methane);

lox
{
    transportModel  Newtonian;
    nu              1e-06;
    rho             1145.4434108400221;
}

methane
{
    transportModel  Newtonian;
    nu              1.48e-05;
    rho             13.306638347029947;
}

sigma           0.07;


// ************************************************************************* //
