OpenFOAM_Testing/run_openfoam_hex_amr/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

vertices
(
    (-0.015 -0.002 -0.002) // 0
    ( 0.105 -0.002 -0.002) // 1
    ( 0.105  0.038 -0.002) // 2
    (-0.015  0.038 -0.002) // 3
    (-0.015 -0.002  0.038) // 4
    ( 0.105 -0.002  0.038) // 5
    ( 0.105  0.038  0.038) // 6
    (-0.015  0.038  0.038) // 7
);

blocks  
(
    // 1mm base cell size: 120 x 40 x 40 cells
    hex (0 1 2 3 4 5 6 7) (120 40 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    boundingWalls
    {
        type patch;
        faces
        (
            (3 2 1 0)
            (4 5 6 7)
            (0 4 7 3)
            (1 2 6 5)
            (0 1 5 4)
            (3 7 6 2)
        );
    }
);