OpenFOAM_Testing/run_openfoam_hex_amr/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     atomizationFoam;

deltaT          1e-5;

writeControl    adjustable;

writeInterval   5e-5;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           2.0;

maxAlphaCo      0.5;

maxDeltaT       1;

startFrom       latestTime; // latestTime - Automatically picks up the latest saved time folder
stopAt          endTime;   // to stop now: writeNow
endTime         0.05;
startTime       0.0;

functions
{
    extractEulerianParticles1
    {
        // Mandatory entries
        type            extractEulerianParticles;
        libs            (fieldFunctionObjects);
        faceZone        collector;
        alpha           alpha.lox;

        // Optional entries
        alphaThreshold  0.1;
        nLocations      20;
        U               U;
        rho             rho;
        phi             phi;
        //minDiameter     1e-30;
        //maxDiameter     1e30;

        // Optional (inherited) entries
        writePrecision   6;
        writeToFile      true;
        useUserTime      false;

        region          region0;
        enabled         false;
        log             true;
        timeStart       0;
        timeEnd         1000;
        executeControl  timeStep;
        executeInterval 1;
        writeControl    writeTime;
        writeInterval   -1;
    }
}


// ************************************************************************* //
