OpenFOAM_Testing/run_openfoam_hex_amr/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains  6;

method          scotch;

// constraints
// {
//     keepAmiOnSingleProc
//     {
//         type            singleProcessorFaceSets;
//         sets            ((amiFaces -1)); // -1 lets OpenFOAM automatically select the optimal processor
//     }
// }

// ************************************************************************* //
