OpenFOAM_Testing/run_openfoam_hex_amr/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Set default phase fraction across the entire mesh (0 = gas/ambient)
defaultFieldValues
(
    volScalarFieldValue alpha.lox 0
);

// Overwrite alpha.lox = 1 inside the specified cylinder
regions
(
    cylinderToCell
    {
        p1      (-0.01 0 0);
        p2      (0.007878237760728126 0 0);
        radius  0.002275; // (4.55e-3 / 2)

        fieldValues
        (
            volScalarFieldValue alpha.lox 1
        );
    }
);

// ************************************************************************* //
